swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Configuration.h
/*******************************************************************************
* \file       CapSense_1_Configuration.h
* \version    3.0
*
* \brief
*   This file provides the customizer parameters definitions.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_SENSE_CapSense_1_CONFIGURATION_H)
#define CY_SENSE_CapSense_1_CONFIGURATION_H

#include "syslib/cy_syslib.h"
#include "cyfitter.h"


/*******************************************************************************
* Customizer-generated defines
*******************************************************************************/
#define CapSense_1_ENABLE                             (1u)
#define CapSense_1_DISABLE                            (0u)

/*******************************************************************************
* Creator-global defines
*******************************************************************************/
#define CapSense_1_2000_MV                            (2000u)

#ifdef CYDEV_VDDA_MV
    #define CapSense_1_CYDEV_VDDA_MV                  (CYDEV_VDDA_MV)
#else
    #ifdef CYDEV_VDD_MV
        #define CapSense_1_CYDEV_VDDA_MV              (CYDEV_VDD_MV)
    #endif
#endif

#define CapSense_1_BAD_CONVERSIONS_NUM                (1u)
#define CapSense_1_RESAMPLING_CYCLES_MAX_NUMBER       (1u)

/*******************************************************************************
* Enabled Scan Methods
*******************************************************************************/
#define CapSense_1_CSD_EN                   (1u)
#define CapSense_1_CSX_EN                   (1u)
#define CapSense_1_CSD_CSX_EN               (CapSense_1_CSD_EN && CapSense_1_CSX_EN)

/*******************************************************************************
* Definitions for number of widgets and sensors
*******************************************************************************/
#define CapSense_1_TOTAL_WIDGETS            (3u)
#define CapSense_1_TOTAL_CSD_WIDGETS        (1u)
#define CapSense_1_TOTAL_CSD_SENSORS        (5u)
#define CapSense_1_TOTAL_CSX_WIDGETS        (2u)
#define CapSense_1_TOTAL_CSX_NODES          (2u)

/*******************************************************************************
* Total number of CSD sensors + CSX nodes
*******************************************************************************/
#define CapSense_1_TOTAL_SENSORS            (CapSense_1_TOTAL_CSD_SENSORS + \
                                                   CapSense_1_TOTAL_CSX_NODES)

/*******************************************************************************
* Total number of scan slots (used only when dual-channel scan is enabled)
*******************************************************************************/
#define CapSense_1_TOTAL_SCAN_SLOTS         (9u)

/*******************************************************************************
* Defines widget IDs
*******************************************************************************/
#define CapSense_1_LINEARSLIDER0_WDGT_ID        (0u)
#define CapSense_1_BUTTON0_WDGT_ID              (1u)
#define CapSense_1_BUTTON1_WDGT_ID              (2u)

/*******************************************************************************
* Defines sensor IDs
*******************************************************************************/

/* LinearSlider0 sensor names */
#define CapSense_1_LINEARSLIDER0_SNS0_ID        (0u)
#define CapSense_1_LINEARSLIDER0_SNS1_ID        (1u)
#define CapSense_1_LINEARSLIDER0_SNS2_ID        (2u)
#define CapSense_1_LINEARSLIDER0_SNS3_ID        (3u)
#define CapSense_1_LINEARSLIDER0_SNS4_ID        (4u)

/* Button0 sensor names */
#define CapSense_1_BUTTON0_SNS0_ID              (0u)

/* Button0 node names */
#define CapSense_1_BUTTON0_RX0_TX0_ID           (0u)

/* Button0 sensor element IDs */
#define CapSense_1_BUTTON0_RX0_ID               (0u)
#define CapSense_1_BUTTON0_TX0_ID               (1u)

/* Button1 sensor names */
#define CapSense_1_BUTTON1_SNS0_ID              (0u)

