swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Configuration.h
/* Button1 node names */
#define CapSense_1_BUTTON1_RX0_TX0_ID           (0u)

/* Button1 sensor element IDs */
#define CapSense_1_BUTTON1_RX0_ID               (0u)
#define CapSense_1_BUTTON1_TX0_ID               (1u)



/*******************************************************************************
* Enabled widget types
*******************************************************************************/
#define CapSense_1_BUTTON_WIDGET_EN         (1u)
#define CapSense_1_SLIDER_WIDGET_EN         (1u)
#define CapSense_1_MATRIX_WIDGET_EN         (0u)
#define CapSense_1_PROXIMITY_WIDGET_EN      (0u)
#define CapSense_1_TOUCHPAD_WIDGET_EN       (0u)

#define CapSense_1_CSD_MATRIX_WIDGET_EN     (0u)
#define CapSense_1_CSD_TOUCHPAD_WIDGET_EN   (0u)

#define CapSense_1_CSX_MATRIX_WIDGET_EN     (0u)
#define CapSense_1_CSX_TOUCHPAD_WIDGET_EN   (0u)

/*******************************************************************************
* Centroid APIs
*******************************************************************************/
#define CapSense_1_CENTROID_EN              (1u)
#define CapSense_1_TOTAL_DIPLEXED_SLIDERS   (0u)
#define CapSense_1_TOTAL_LINEAR_SLIDERS     (1u)
#define CapSense_1_TOTAL_RADIAL_SLIDERS     (0u)
#define CapSense_1_TOTAL_TOUCHPADS          (0u)
#define CapSense_1_MAX_CENTROID_LENGTH      (5u)
#define CapSense_1_SLIDER_MULT_METHOD       (0u)
#define CapSense_1_TOUCHPAD_MULT_METHOD     (0u)

/*******************************************************************************
* Enabled sensor types
*******************************************************************************/
#define CapSense_1_REGULAR_SENSOR_EN        (1u)
#define CapSense_1_PROXIMITY_SENSOR_EN      (0u)

/*******************************************************************************
* Sensor ganging
*******************************************************************************/
#define CapSense_1_GANGED_SNS_EN            (0u)
#define CapSense_1_CSD_GANGED_SNS_EN        (0u)
#define CapSense_1_CSX_GANGED_SNS_EN        (0u)

/*******************************************************************************
* Max number of sensors used among all the widgets
*******************************************************************************/
#define CapSense_1_MAX_SENSORS_PER_WIDGET   (5u)
#define CapSense_1_MAX_SENSORS_PER_5X5_TOUCHPAD (1u)

/*******************************************************************************
* Total number of all used electrodes (NOT unique)
*******************************************************************************/
#define CapSense_1_TOTAL_ELECTRODES         (9u)
/* Obsolete */
#define CapSense_1_TOTAL_SENSOR_IOS         CapSense_1_TOTAL_ELECTRODES

/*******************************************************************************
* Total number of used physical IOs (unique)
*******************************************************************************/
#define CapSense_1_TOTAL_IO_CNT             (8u)

/*******************************************************************************
* Array length for widget status registers
*******************************************************************************/
#define CapSense_1_WDGT_STATUS_WORDS        \
                        (((uint8)((CapSense_1_TOTAL_WIDGETS - 1u) / 32u)) + 1u)


/*******************************************************************************
* Auto-tuning mode selection
*******************************************************************************/
#define CapSense_1_CSD_SS_DIS         (0x00ul)
#define CapSense_1_CSD_SS_HW_EN       (0x01ul)
#define CapSense_1_CSD_SS_TH_EN       (0x02ul)
#define CapSense_1_CSD_SS_HWTH_EN     (CapSense_1_CSD_SS_HW_EN | \
                                             CapSense_1_CSD_SS_TH_EN)

#define CapSense_1_CSD_AUTOTUNE       CapSense_1_CSD_SS_HWTH_EN


/*******************************************************************************
* General settings
*******************************************************************************/

#define CapSense_1_AUTO_RESET_METHOD_LEGACY (0u)
#define CapSense_1_AUTO_RESET_METHOD_SAMPLE (1u)

#define CapSense_1_MULTI_FREQ_SCAN_EN       (0u)
#define CapSense_1_SENSOR_AUTO_RESET_EN     (0u)
#define CapSense_1_SENSOR_AUTO_RESET_METHOD (0u)
#define CapSense_1_NUM_CENTROIDS            (1u)
#define CapSense_1_4PTS_LOCAL_MAX_EN        (0u)
#define CapSense_1_OFF_DEBOUNCE_EN          (0u)
#define CapSense_1_CUSTOM_DS_RAM_SIZE       (0u)

/* Defines power status of HW IP block after scanning */
#define CapSense_1_BLOCK_OFF_AFTER_SCAN_EN  (0u)

/* Defines number of scan frequencies */
#if (CapSense_1_DISABLE != CapSense_1_MULTI_FREQ_SCAN_EN)
    #define CapSense_1_NUM_SCAN_FREQS       (3u)
#else
    #define CapSense_1_NUM_SCAN_FREQS       (1u)
#endif /* #if (CapSense_1_DISABLE != CapSense_1_MULTI_FREQ_SCAN_EN) */

/* Data size for thresholds / low baseline reset */
#define CapSense_1_SIZE_8BITS               (8u)
#define CapSense_1_SIZE_16BITS              (16u)

#define CapSense_1_THRESHOLD_SIZE           CapSense_1_SIZE_16BITS
typedef uint16 CapSense_1_THRESHOLD_TYPE;

#if (CapSense_1_AUTO_RESET_METHOD_LEGACY == CapSense_1_SENSOR_AUTO_RESET_METHOD)
    #define CapSense_1_LOW_BSLN_RST_SIZE        CapSense_1_SIZE_8BITS
    typedef uint8 CapSense_1_LOW_BSLN_RST_TYPE;
#else
    #define CapSense_1_LOW_BSLN_RST_SIZE    (16u)
    typedef uint16 CapSense_1_LOW_BSLN_RST_TYPE;
#endif /* #if (CapSense_1_AUTO_RESET_METHOD_LEGACY == CapSense_1_SENSOR_AUTO_RESET_METHOD) */

/* Coefficient to define touch threshold for proximity sensors */
#define CapSense_1_PROX_TOUCH_COEFF         (300u)

/*******************************************************************************
* General Filter Constants
*******************************************************************************/

/* Baseline algorithm options */
#define CapSense_1_IIR_BASELINE                 (0u)
#define CapSense_1_BUCKET_BASELINE              (1u)

#define CapSense_1_BASELINE_TYPE                CapSense_1_IIR_BASELINE

/* IIR baseline filter algorithm for regular sensors*/
#define CapSense_1_REGULAR_IIR_BL_TYPE          CapSense_1_IIR_FILTER_PERFORMANCE

/* IIR baseline coefficients for regular sensors */
#define CapSense_1_REGULAR_IIR_BL_N             (1u)
#define CapSense_1_REGULAR_IIR_BL_SHIFT         (8u)

/* IIR baseline filter algorithm for proximity sensors*/
#define CapSense_1_PROX_IIR_BL_TYPE             CapSense_1_IIR_FILTER_PERFORMANCE

