swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Configuration.h
/* IIR baseline coefficients for proximity sensors */
#define CapSense_1_PROX_IIR_BL_N                (1u)
#define CapSense_1_PROX_IIR_BL_SHIFT            (8u)


/* IIR filter constants */
#define CapSense_1_IIR_COEFFICIENT_K            (256u)

/* IIR filter type */
#define CapSense_1_IIR_FILTER_STANDARD          (1u)
#define CapSense_1_IIR_FILTER_PERFORMANCE       (2u)
#define CapSense_1_IIR_FILTER_MEMORY            (3u)

/* Raw count filters */
#define CapSense_1_RC_FILTER_EN                 (CapSense_1_REGULAR_RC_FILTER_EN || CapSense_1_PROX_RC_FILTER_EN)

/* Regular sensor raw count filters */
#define CapSense_1_REGULAR_RC_FILTER_EN         (0u)
#define CapSense_1_REGULAR_RC_IIR_FILTER_EN     (0u)
#define CapSense_1_REGULAR_RC_MEDIAN_FILTER_EN  (0u)
#define CapSense_1_REGULAR_RC_AVERAGE_FILTER_EN (0u)
#define CapSense_1_REGULAR_RC_CUSTOM_FILTER_EN  (0u)
#define CapSense_1_REGULAR_RC_ALP_FILTER_EN     (0u)

/* Proximity sensor raw count filters */
#define CapSense_1_PROX_RC_FILTER_EN            (0u)
#define CapSense_1_PROX_RC_IIR_FILTER_EN        (0u)
#define CapSense_1_PROX_RC_MEDIAN_FILTER_EN     (0u)
#define CapSense_1_PROX_RC_AVERAGE_FILTER_EN    (0u)
#define CapSense_1_PROX_RC_CUSTOM_FILTER_EN     (0u)
#define CapSense_1_PROX_RC_ALP_FILTER_EN        (0u)

#define CapSense_1_ALP_FILTER_EN                (0u)
#define CapSense_1_REGULAR_RC_ALP_FILTER_COEFF  (2u)
#define CapSense_1_PROX_RC_ALP_FILTER_COEFF     (2u)

/* IIR raw count filter algorithm for regular sensors */
#define CapSense_1_REGULAR_IIR_RC_TYPE          (CapSense_1_IIR_FILTER_STANDARD)

/* IIR raw count filter coefficients for regular sensors */
#define CapSense_1_REGULAR_IIR_RC_N             (128u)
#define CapSense_1_REGULAR_IIR_RC_SHIFT         (0u)

/* IIR raw count filter algorithm for proximity sensors*/
#define CapSense_1_PROX_IIR_RC_TYPE             (CapSense_1_IIR_FILTER_STANDARD)

/* IIR raw count filter coefficients for proximity sensors */
#define CapSense_1_PROX_IIR_RC_N                (128u)
#define CapSense_1_PROX_IIR_RC_SHIFT            (0u)

/* Median filter constants */

/* Order of regular sensor median filter */
#define CapSense_1_REGULAR_MEDIAN_LEN           (2u)

/* Order of proximity sensor median filter */
#define CapSense_1_PROX_MEDIAN_LEN              (2u)

/* Average filter constants*/
#define CapSense_1_AVERAGE_FILTER_LEN_2         (1u)
#define CapSense_1_AVERAGE_FILTER_LEN_4         (3u)

/* Order of regular sensor average filter */
#define CapSense_1_REGULAR_AVERAGE_LEN          (CapSense_1_AVERAGE_FILTER_LEN_4)

/* Order of proximity sensor average filter */
#define CapSense_1_PROX_AVERAGE_LEN             (CapSense_1_AVERAGE_FILTER_LEN_4)

/* Widget baseline coefficient enable */
#define CapSense_1_WD_BSLN_COEFF_EN             (0u)

/* Centroid position filters */
#define CapSense_1_POSITION_FILTER_EN           (0u)
#define CapSense_1_POS_MEDIAN_FILTER_EN         (0u)
#define CapSense_1_POS_IIR_FILTER_EN            (0u)
#define CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN   (0u)
#define CapSense_1_POS_AVERAGE_FILTER_EN        (0u)
#define CapSense_1_POS_JITTER_FILTER_EN         (0u)
#define CapSense_1_BALLISTIC_MULTIPLIER_EN      (0u)
#define CapSense_1_CENTROID_3X3_CSD_EN          (0u)
#define CapSense_1_CENTROID_5X5_CSD_EN          (0u)
#define CapSense_1_CSD_5X5_MAX_FINGERS          (1u)

#define CapSense_1_POS_IIR_COEFF                (128u)
#define CapSense_1_POS_IIR_RESET_RADIAL_SLIDER  (35u)

#define CapSense_1_CSX_TOUCHPAD_UNDEFINED       (40u)

/* IDAC options */
#define CapSense_1_IDAC_GAIN_LOW                (0uL)
#define CapSense_1_IDAC_GAIN_MEDIUM             (1uL)
#define CapSense_1_IDAC_GAIN_HIGH               (2uL)

#define CapSense_1_IDAC_SOURCING                (0u)
#define CapSense_1_IDAC_SINKING                 (1u)

/* Shield tank capacitor precharge source */
#define CapSense_1_CSH_PRECHARGE_VREF           (0u)
#define CapSense_1_CSH_PRECHARGE_IO_BUF         (1u)

/* Shield electrode delay */
#define CapSense_1_NO_DELAY                     (0u)
#define CapSense_1_SH_DELAY_5NS                 (1u)
#define CapSense_1_SH_DELAY_10NS                (2u)
#define CapSense_1_SH_DELAY_20NS                (3u)

/* Inactive sensor connection options */
#define CapSense_1_SNS_CONNECTION_GROUND        (1u)
#define CapSense_1_SNS_CONNECTION_HIGHZ         (2u)
#define CapSense_1_SNS_CONNECTION_SHIELD        (3u)

/* Sense clock selection options */
#define CapSense_1_CLK_SOURCE_DIRECT            (0x00000000Lu)

#define CapSense_1_CLK_SOURCE_SSC1              (0x01u)
#define CapSense_1_CLK_SOURCE_SSC2              (0x02u)
#define CapSense_1_CLK_SOURCE_SSC3              (0x03u)
#define CapSense_1_CLK_SOURCE_SSC4              (0x04u)

#define CapSense_1_CLK_SOURCE_PRS8              (0x05u)
#define CapSense_1_CLK_SOURCE_PRS12             (0x06u)
#define CapSense_1_CLK_SOURCE_PRSAUTO           (0xFFu)

/* Defines scan resolutions */
#define CapSense_1_RES6BIT                      (6u)
#define CapSense_1_RES7BIT                      (7u)
#define CapSense_1_RES8BIT                      (8u)
#define CapSense_1_RES9BIT                      (9u)
#define CapSense_1_RES10BIT                     (10u)
#define CapSense_1_RES11BIT                     (11u)
#define CapSense_1_RES12BIT                     (12u)
#define CapSense_1_RES13BIT                     (13u)
#define CapSense_1_RES14BIT                     (14u)
#define CapSense_1_RES15BIT                     (15u)
#define CapSense_1_RES16BIT                     (16u)

/* Initialization switch resistance */
#define CapSense_1_INIT_SW_RES_LOW              (0x00000000Lu)
#define CapSense_1_INIT_SW_RES_MEDIUM           (0x00000001Lu)
#define CapSense_1_INIT_SW_RES_HIGH             (0x00000002Lu)

/* Initialization switch resistance */
#define CapSense_1_SCAN_SW_RES_LOW              (0x00000000Lu)
#define CapSense_1_SCAN_SW_RES_MEDIUM           (0x00000001Lu)
#define CapSense_1_SCAN_SW_RES_HIGH             (0x00000002Lu)

/* CSD shield switch resistance */
#define CapSense_1_SHIELD_SW_RES_LOW            (0x00000000Lu)
#define CapSense_1_SHIELD_SW_RES_MEDIUM         (0x00000001Lu)
#define CapSense_1_SHIELD_SW_RES_HIGH           (0x00000002Lu)
#define CapSense_1_SHIELD_SW_RES_LOW_EMI        (0x00000003Lu)

/* CSD shield switch resistance */
#define CapSense_1_INIT_SHIELD_SW_RES_LOW       (0x00000000Lu)
#define CapSense_1_INIT_SHIELD_SW_RES_MEDIUM    (0x00000001Lu)
#define CapSense_1_INIT_SHIELD_SW_RES_HIGH      (0x00000002Lu)
#define CapSense_1_INIT_SHIELD_SW_RES_LOW_EMI   (0x00000003Lu)

/* CSD shield switch resistance */
#define CapSense_1_SCAN_SHIELD_SW_RES_LOW       (0x00000000Lu)
#define CapSense_1_SCAN_SHIELD_SW_RES_MEDIUM    (0x00000001Lu)
#define CapSense_1_SCAN_SHIELD_SW_RES_HIGH      (0x00000002Lu)
#define CapSense_1_SCAN_SHIELD_SW_RES_LOW_EMI   (0x00000003Lu)

/* Vref source */
#define CapSense_1_VREF_SRSS                    (0x00000000Lu)
#define CapSense_1_VREF_PASS                    (0x00000001Lu)

