swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Configuration.h
/*******************************************************************************
* LinearSlider0 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_1_LINEARSLIDER0_RESOLUTION     (CapSense_1_RES12BIT)
#define CapSense_1_LINEARSLIDER0_FINGER_TH      (100u)
#define CapSense_1_LINEARSLIDER0_NOISE_TH       (40u)
#define CapSense_1_LINEARSLIDER0_NNOISE_TH      (40u)
#define CapSense_1_LINEARSLIDER0_HYSTERESIS     (10u)
#define CapSense_1_LINEARSLIDER0_ON_DEBOUNCE    (3u)
#define CapSense_1_LINEARSLIDER0_LOW_BSLN_RST   (30u)
#define CapSense_1_LINEARSLIDER0_IDAC_MOD0      (32u)
#define CapSense_1_LINEARSLIDER0_SNS_CLK        (4u)
#define CapSense_1_LINEARSLIDER0_SNS_CLK_SOURCE (0u)
#define CapSense_1_LINEARSLIDER0_FINGER_CAP     (160u)
#define CapSense_1_LINEARSLIDER0_SIGPFC         (0u)
#define CapSense_1_LINEARSLIDER0_POSITION       (0xFFFFu)

/*******************************************************************************
* Button0 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_1_BUTTON0_STATIC_CONFIG        (10249u)
#define CapSense_1_BUTTON0_NUM_SENSORS          (1u)

/*******************************************************************************
* Button0 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_1_BUTTON0_RESOLUTION           (100u)
#define CapSense_1_BUTTON0_FINGER_TH            (100u)
#define CapSense_1_BUTTON0_NOISE_TH             (40u)
#define CapSense_1_BUTTON0_NNOISE_TH            (40u)
#define CapSense_1_BUTTON0_HYSTERESIS           (10u)
#define CapSense_1_BUTTON0_ON_DEBOUNCE          (3u)
#define CapSense_1_BUTTON0_LOW_BSLN_RST         (30u)
#define CapSense_1_BUTTON0_IDAC_MOD0            (32u)
#define CapSense_1_BUTTON0_SNS_CLK              (167u)
#define CapSense_1_BUTTON0_SNS_CLK_SOURCE       (0u)
#define CapSense_1_BUTTON0_FINGER_CAP           (160u)
#define CapSense_1_BUTTON0_SIGPFC               (0u)

/*******************************************************************************
* Button1 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_1_BUTTON1_STATIC_CONFIG        (10241u)
#define CapSense_1_BUTTON1_NUM_SENSORS          (1u)

/*******************************************************************************
* Button1 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_1_BUTTON1_RESOLUTION           (100u)
#define CapSense_1_BUTTON1_FINGER_TH            (100u)
#define CapSense_1_BUTTON1_NOISE_TH             (40u)
#define CapSense_1_BUTTON1_NNOISE_TH            (40u)
#define CapSense_1_BUTTON1_HYSTERESIS           (10u)
#define CapSense_1_BUTTON1_ON_DEBOUNCE          (3u)
#define CapSense_1_BUTTON1_LOW_BSLN_RST         (30u)
#define CapSense_1_BUTTON1_IDAC_MOD0            (32u)
#define CapSense_1_BUTTON1_SNS_CLK              (167u)
#define CapSense_1_BUTTON1_SNS_CLK_SOURCE       (0u)
#define CapSense_1_BUTTON1_FINGER_CAP           (160u)
#define CapSense_1_BUTTON1_SIGPFC               (0u)

/* RAM Sensor Parameters Definitions */
#define CapSense_1_LINEARSLIDER0_SNS0_IDAC_COMP0 (32u)
#define CapSense_1_LINEARSLIDER0_SNS1_IDAC_COMP0 (32u)
#define CapSense_1_LINEARSLIDER0_SNS2_IDAC_COMP0 (32u)
#define CapSense_1_LINEARSLIDER0_SNS3_IDAC_COMP0 (32u)
#define CapSense_1_LINEARSLIDER0_SNS4_IDAC_COMP0 (32u)
#define CapSense_1_BUTTON0_RX0_IDAC_COMP0       (32u)
#define CapSense_1_BUTTON1_RX0_IDAC_COMP0       (32u)



/*******************************************************************************
* ADC Specific Macros
*******************************************************************************/
#define CapSense_1_ADC_RES8BIT                  (8u)
#define CapSense_1_ADC_RES10BIT                 (10u)

#define CapSense_1_ADC_FULLRANGE_MODE           (0u)
#define CapSense_1_ADC_VREF_MODE                (1u)

#define CapSense_1_ADC_MIN_CHANNELS             (1u)
#define CapSense_1_ADC_EN                       (0u)
#define CapSense_1_ADC_STANDALONE_EN            (0u)
#define CapSense_1_ADC_TOTAL_CHANNELS           (0u)
#define CapSense_1_ADC_RESOLUTION               (CapSense_1_ADC_RES10BIT)
#define CapSense_1_ADC_AMUXB_INPUT_EN           (0u)
#define CapSense_1_ADC_SELECT_AMUXB_CH          (0u)
#define CapSense_1_ADC_AZ_EN                    (1Lu)
#define CapSense_1_ADC_AZ_TIME                  (5u)
#define CapSense_1_ADC_VREF_MV                  (2133u)
#define CapSense_1_ADC_GAIN                     (11Lu)
#define CapSense_1_ADC_IDAC_DEFAULT             (31u)
#define CapSense_1_ADC_MODCLK_DIV_DEFAULT       (1u)
#define CapSense_1_ADC_MEASURE_MODE             (CapSense_1_ADC_FULLRANGE_MODE)
#define CapSense_1_ADC_ANALOG_STARTUP_DELAY_US  (23u)

/*******************************************************************************
* Built-In Self-Test Configuration
*******************************************************************************/
#define CapSense_1_SELF_TEST_EN                   (0Lu)
#define CapSense_1_TST_GLOBAL_CRC_EN              (0Lu)
#define CapSense_1_TST_WDGT_CRC_EN                (0Lu)
#define CapSense_1_TST_BSLN_DUPLICATION_EN        (0Lu)
#define CapSense_1_TST_BSLN_RAW_OUT_RANGE_EN      (0Lu)
#define CapSense_1_TST_SNS_SHORT_EN               (0Lu)
#define CapSense_1_TST_SNS2SNS_SHORT_EN           (0Lu)
#define CapSense_1_TST_SNS_CAP_EN                 (0Lu)
#define CapSense_1_TST_SH_CAP_EN                  (0Lu)
#define CapSense_1_TST_EXTERNAL_CAP_EN            (0Lu)
#define CapSense_1_TST_INTERNAL_CAP_EN            (0Lu)
#define CapSense_1_TST_VDDA_EN                    (0Lu)
#define CapSense_1_TST_FINE_INIT_TIME             (1Lu)


#define CapSense_1_TST_ANALOG_STARTUP_DELAY_US    (23u)

/*******************************************************************************
* Gesture Configuration
*******************************************************************************/
#define CapSense_1_TIMESTAMP_INTERVAL             (1Lu)
#define CapSense_1_GESTURE_EN_WIDGET_ID           (0Lu)
#define CapSense_1_BALLISTIC_EN_WIDGET_ID         (0Lu)


#endif /* CY_SENSE_CapSense_1_CONFIGURATION_H */


/* [] END OF FILE */
